Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВалюты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущееНаименованиеВалюты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.НаименованиеВалюты) Тогда
		Объект.НаименованиеВалюты = ПредопределенноеЗначение("Справочник.Валюты.RUB");
	КонецЕсли;
	
	Объект.ПредыдущееНаименованиеВалюты = Объект.НаименованиеВалюты;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РасчетСуммы(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РасчетСуммы(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура РасчетСуммы(СтрокаТабличнойЧасти) 
	СерверныеПроцедуры.АвтоСумма(СтрокаТабличнойЧасти);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

#Область ВидЦены
&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)	
	ОтсутствиеЦены = ВыгрузитьСписокНоменклатуры();
	
	Если ОтсутствиеЦены Тогда 
		ПоказатьУведомлениеОбОтсутствииЦены();
	КонецЕсли;
	
	Объект.НаименованиеВалюты = ПредопределенноеЗначение("Справочник.Валюты.RUB"); 
	Объект.ПредыдущееНаименованиеВалюты = Объект.НаименованиеВалюты;
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");

КонецПроцедуры

&НаСервере
Функция ВыгрузитьСписокНоменклатуры();
	
	СписокНоменклатурыВыгрузить = Объект.СписокНоменклатуры.Выгрузить(,"Номенклатура");
		
	ТаблицаЗначенийЦен = ПолучитьСписокЦен(СписокНоменклатурыВыгрузить, Объект.ВидЦены); 
	
	ФлагОтсутствияЦены = Ложь;
	
	Для Каждого СтрокаСпискаНоменклатуры Из Объект.СписокНоменклатуры Цикл
		ТаблицаЗначенийЦенНоменклатура = ТаблицаЗначенийЦен.Найти(СтрокаСпискаНоменклатуры.Номенклатура, "Номенклатура");
		
		Если ТаблицаЗначенийЦенНоменклатура <> Неопределено Тогда
			СтрокаСпискаНоменклатуры.Цена = ТаблицаЗначенийЦенНоменклатура.Цена;
			СтрокаСпискаНоменклатуры.Сумма = ТаблицаЗначенийЦенНоменклатура.Цена * СтрокаСпискаНоменклатуры.Количество;
		Иначе
			СтрокаСпискаНоменклатуры.Цена = 0;
			СтрокаСпискаНоменклатуры.Сумма = 0;
			ФлагОтсутствияЦены = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ФлагОтсутствияЦены;	
	
КонецФункции 
#КонецОбласти

#Область СписокНоменклатуры
&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ЦенаЭлемента = ВыгрузитьСтрокуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура); 
	
	СтрокаТабличнойЧасти.Цена = ЦенаЭлемента;
	
	Если ЦенаЭлемента = 0 Тогда 
		ПоказатьУведомлениеОбОтсутствииЦены();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыгрузитьСтрокуНоменклатуры(СтрокаСпискаНоменклатуры);	
	ЦенаЭлемента = ПолучитьСписокЦен(СтрокаСпискаНоменклатуры, Объект.ВидЦены);		
	
	Если ЦенаЭлемента.Количество() <> 0 Тогда 
		Возврат ЦенаЭлемента[0].Цена;
	Иначе 
		Возврат 0;
	КонецЕсли;
КонецФункции
#КонецОбласти

#Область ИзмененияВалют
&НаКлиенте
Процедура НаименованиеВалютыПриИзменении(Элемент) 
	
	Если Объект.НаименованиеВалюты = Объект.ПредыдущееНаименованиеВалюты Тогда
		Возврат
	КонецЕсли;
		
	НаименованиеВалютыПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура НаименованиеВалютыПриИзмененииНаСервере() 
	
	ТЗВалютаПредыдущее = СерверныеПроцедуры.ПолучитьСведенияОВалюте(Объект.ПредыдущееНаименованиеВалюты.Наименование);
	ТЗВалюта = СерверныеПроцедуры.ПолучитьСведенияОВалюте(Объект.НаименованиеВалюты.Наименование);

	СтрокаТЗВалютаПредыдущее = ТЗВалютаПредыдущее[0];
	СтрокаТЗВалюта = ТЗВалюта[0];
	
	Для Каждого СтрокаТЧ Из Объект.СписокНоменклатуры Цикл
		СтрокаТЧ.Цена = СтрокаТЧ.Цена * ((СтрокаТЗВалютаПредыдущее.КурсВалюты / СтрокаТЗВалютаПредыдущее.Номинал) / (СтрокаТЗВалюта.КурсВалюты / СтрокаТЗВалюта.Номинал));
		СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	КонецЦикла;  
	
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");		
    Объект.ПредыдущееНаименованиеВалюты = Объект.НаименованиеВалюты; 
	
КонецПроцедуры
#КонецОбласти




&НаСервере
Функция ПолучитьСписокЦен(МассивНоменклатур, ВидЦены)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура В(&МассивНоменклатур)
		|	И ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
	
	Запрос.УстановитьПараметр("МассивНоменклатур", МассивНоменклатур);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса;
	
КонецФункции 

&НаКлиенте
Процедура ПоказатьУведомлениеОбОтсутствииЦены()
	Сообщение = Новый СообщениеПользователю();	
	Сообщение.Текст = "Не удалось найти цену для одной или нескольких номенклатур!";
	
	Сообщение.Сообщить();	
КонецПроцедуры
